target/surefire-reports/src.test.java.com.wellsfargo.featurefiles.Karate04_soap.html

<!DOCTYPE html>
<html lang="en">
  
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
    
<meta charset="utf-8">
    
<meta content="width=device-width, initial-scale=1, shrink-to-fit=no" name="viewport">
    
<link href="res/bootstrap.min.css" rel="stylesheet" type="text/css">
    
<link href="res/karate-report.css" rel="stylesheet" type="text/css">
    
<link href="favicon.ico" rel="shortcut icon">
    
<script src="res/jquery.min.js" type="text/javascript"></script>
    <script src="res/jquery.tablesorter.min.js" type="text/javascript"></script>
    <script src="res/bootstrap.min.js" type="text/javascript"></script>
    <script src="res/karate-report.js" type="text/javascript"></script>
    
<title>src.test.java.com.wellsfargo.featurefiles.Karate04_soap</title>
  
</head>
  
<body>
    
<div id="root-container">
      
<div id="leftnav">
        
<div class="nav-logo">
          
<a href="karate-summary.html">
            <img alt="Karate" src="res/karate-logo.svg">
          </a>
          
<div class="nav-count">
            
<div class="bg-success" id="nav-pass">1</div>
            
<div class="bg-danger" id="nav-fail">0</div>
          
</div>
        
</div>
        
<div id="nav-type">Scenarios</div>         
        
<div id="nav-date">2021-06-01 02:09:18 PM</div>        
      
<div class="nav-container">
<div class="nav-item passed">
<a href="#[2:27]">[2:27] SOAP 1.2 validation test case 1 This is the first SOAP test case</a>
</div>
</div>
</div>
      
<div id="content">
      
<div class="page-heading alert alert-primary">
<a href="karate-summary.html">Summary</a><span class="feature-label">|</span><a href="karate-tags.html">Tags</a><span class="feature-label">|</span><span class="feature-label">Feature:</span><span class="feature-name">src/test/java/com/wellsfargo/featurefiles/Karate04_soap.feature</span><span class="feature-description">Karate Test Suite 4 | SOAP Api validation</span>
</div>
<div class="scenario">
<div class="scenario-heading" id="[2:27]">
<div class="heading-container">
<div class="scenario-tags"></div>
<span class="scenario-keyword">Scenario: [2:27]</span><span class="scenario-name">SOAP 1.2 validation test case 1 This is the first SOAP test case</span>
</div>
<div class="scenario-time passed">ms: 3609</div>
</div>
<div class="step-row">
<div class="step-container" id="1">
<div class="step-ref passed">1</div>
<div class="step-cell passed">Given url "https://www.w3schools.com/xml/tempconvert.asmx"</div>
</div>
<div class="time-cell passed">9</div>
</div>
<div class="preformatted" data-parent="1">14:09:14.364 skipping bootstrap configuration: could not find or read file: classpath:karate-config.js</div>
<div class="step-row">
<div class="step-container" id="2">
<div class="step-ref passed">2</div>
<div class="step-cell passed">And header Content-Type = "application/soap+xml; charset=utf-8"</div>
</div>
<div class="time-cell passed">10</div>
</div>
<div class="step-row">
<div class="step-container" id="3">
<div class="step-ref passed">3</div>
<div class="step-cell passed">And request</div>
</div>
<div class="time-cell passed">10</div>
</div>
<div class="preformatted" data-parent="3">&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope"&gt;
  &lt;soap12:Body&gt;
    &lt;CelsiusToFahrenheit xmlns="https://www.w3schools.com/xml/"&gt;
      &lt;Celsius&gt;40&lt;/Celsius&gt;
    &lt;/CelsiusToFahrenheit&gt;
  &lt;/soap12:Body&gt;
&lt;/soap12:Envelope&gt;</div>
<div class="step-row">
<div class="step-container" id="4">
<div class="step-ref passed">4</div>
<div class="step-cell passed">When method post</div>
</div>
<div class="time-cell passed">3580</div>
</div>
<div class="preformatted" data-parent="4">14:09:16.508 request:
1 &gt; POST https://www.w3schools.com/xml/tempconvert.asmx
1 &gt; Accept-Encoding: gzip,deflate
1 &gt; Connection: Keep-Alive
1 &gt; Content-Length: 349
1 &gt; Content-Type: application/soap+xml; charset=UTF-8
1 &gt; Host: www.w3schools.com
1 &gt; User-Agent: Apache-HttpClient/4.5.12 (Java/1.8.0_251)
&lt;soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"&gt;&#13;
  &lt;soap12:Body&gt;&#13;
    &lt;CelsiusToFahrenheit xmlns="https://www.w3schools.com/xml/"&gt;&#13;
      &lt;Celsius&gt;40&lt;/Celsius&gt;&#13;
    &lt;/CelsiusToFahrenheit&gt;&#13;
  &lt;/soap12:Body&gt;&#13;
&lt;/soap12:Envelope&gt;

14:09:18.022 response time in milliseconds: 1475.65
1 &lt; 200
1 &lt; Cache-Control: private, max-age=0,public
1 &lt; Content-Length: 400
1 &lt; Content-Security-Policy: frame-ancestors 'self' https://mycourses.w3schools.com;
1 &lt; Content-Type: application/soap+xml; charset=utf-8
1 &lt; Date: Tue, 01 Jun 2021 08:26:23 GMT
1 &lt; Server: Microsoft-IIS/7.5
1 &lt; X-AspNet-Version: 4.0.30319
1 &lt; X-Content-Security-Policy: frame-ancestors 'self' https://mycourses.w3schools.com;
1 &lt; X-Powered-By: ASP.NET
&lt;?xml version="1.0" encoding="utf-8"?&gt;&lt;soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"&gt;&lt;soap:Body&gt;&lt;CelsiusToFahrenheitResponse xmlns="https://www.w3schools.com/xml/"&gt;&lt;CelsiusToFahrenheitResult&gt;104&lt;/CelsiusToFahrenheitResult&gt;&lt;/CelsiusToFahrenheitResponse&gt;&lt;/soap:Body&gt;&lt;/soap:Envelope&gt;</div>
<div class="step-row">
<div class="step-container" id="5">
<div class="step-ref passed">5</div>
<div class="step-cell passed">Then status 200</div>
</div>
<div class="time-cell passed">0</div>
</div>
</div>
</div>
    
</div>   
  
</body>

</html>
